# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

x = 8
print("volume = ", x**3)
print("surface area  = ", x**2 * 6)
