# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

x = 8
y = 10
print("arithmetic = ", (x + y) / 2)

print("geometric = ", (x*y)**0.5)
