# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

a = 13
b = 84
print(a + b)
print(a - b)
print(a * b)
