# Даны действительные числа x и y. Получить (|x| − |y| )/( 1+ |xy|)

x = 145
y = 94

answer = (abs(x) - abs(y) ) / (1 + abs(x * y)) 
print(answer)
