# Даны действительные числа x и y. Получить (|x| − |y| )/( 1+ |xy|)

x = 145
y = 94

answer = (x - y ) / (1 + x * y)
print(answer)
